In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np

In [2]:
import statistics as st

In [3]:
dataset = pd.read_csv('ds_salaries.csv')
dataset.head()
# print(dataset)

,id,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S
2,2,2020,SE,FT,Big Data Engineer,85000,GBP,109024,GB,50,GB,M
3,3,2020,MI,FT,Product Data Analyst,20000,USD,20000,HN,0,HN,S
4,4,2020,SE,FT,Machine Learning Engineer,150000,USD,150000,US,50,US,L

In [6]:
x=dataset.sample(30)
x.head()
# print(x)

,id,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
183,183,2021,SE,FT,Finance Data Analyst,45000,GBP,61896,GB,50,GB,L
240,240,2021,SE,FT,Data Scientist,130000,CAD,103691,CA,100,CA,L
465,465,2022,EN,FT,Data Engineer,120000,USD,120000,US,100,US,M
325,325,2022,SE,FT,Data Analyst,124190,USD,124190,US,100,US,M
171,171,2021,MI,FT,Data Engineer,60000,GBP,82528,GB,100,GB,L

In [7]:
x.shape

(30, 12)

In [ ]:
datas = x['Purchase Amount (USD)']
datas.head